<a href="https://colab.research.google.com/github/JakeOh/202007_itw_bd18/blob/master/lab_python/python56_reshape.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

In [2]:
import numpy as np
import pandas as pd

# DataFrame의 모양(shape)을 변경

* Wide -> Long
* Long -> Wide

* stack(): Wide -> Long, columns -> MultiIndex
* unstack(): Long -> Wide, MultiIndex -> columns

In [4]:
df = pd.DataFrame(data=np.arange(6).reshape((2, 3)),
                  index=['A', 'B'],
                  columns=['a', 'b', 'c'])
df

   a  b  c
A  0  1  2
B  3  4  5

In [5]:
df_stacked = df.stack()
df_stacked

A  a    0
   b    1
   c    2
B  a    3
   b    4
   c    5
dtype: int64

In [6]:
df_unstacked = df_stacked.unstack()
df_unstacked
# unstack() 함수의 기본 동작은 가장 마지막 level의 인덱스들을 컬럼으로 변환.

   a  b  c
A  0  1  2
B  3  4  5

In [7]:
df_unstacked2 = df_stacked.unstack(level=0)
df_unstacked2

   A  B
a  0  3
b  1  4
c  2  5

* pivot(): Long -> Wide, row -> column
* melt(): Wide -> Long, column -> row

In [11]:
df = pd.DataFrame(data={'A': ['one', 'one', 'one', 'two', 'two', 'two'],
                        'B': ['a', 'b', 'c', 'a', 'b', 'c'],
                        'C': [1, 2, 3, 4, 5, 6],
                        'D': [2, 4, 8, 1, 3, 5]})
df

     A  B  C  D
0  one  a  1  2
1  one  b  2  4
2  one  c  3  8
3  two  a  4  1
4  two  b  5  3
5  two  c  6  5

In [12]:
pivot1 = df.pivot(index='A', columns='B', values='C')
pivot1

B    a  b  c
A
one  1  2  3
two  4  5  6

In [13]:
df.pivot(index='A', columns='B', values='D')

B    a  b  c
A
one  2  4  8
two  1  3  5

In [14]:
df.pivot(index='B', columns='A', values='C')

A  one  two
B
a    1    4
b    2    5
c    3    6

In [15]:
df

     A  B  C  D
0  one  a  1  2
1  one  b  2  4
2  one  c  3  8
3  two  a  4  1
4  two  b  5  3
5  two  c  6  5

In [16]:
df.pivot(index='A', columns='B', values=['C', 'D'])

     C        D
B    a  b  c  a  b  c
A
one  1  2  3  2  4  8
two  4  5  6  1  3  5

In [18]:
df = pd.DataFrame(data={'key1':['KO', 'KO', 'KO', 'US', 'US', 'US'],
                        'key2':['a1', 'a1', 'a2', 'a1', 'a1', 'a2'],
                        'key3':['b1', 'b2', 'b1', 'b2', 'b1', 'b2'],
                        'key4':['c1', 'c2', 'c3', 'c1', 'c2', 'c3'],
                        'values': [1, 2, 3, 4, 5, 6]})
df

  key1 key2 key3 key4  values
0   KO   a1   b1   c1       1
1   KO   a1   b2   c2       2
2   KO   a2   b1   c3       3
3   US   a1   b2   c1       4
4   US   a1   b1   c2       5
5   US   a2   b2   c3       6

In [20]:
# df.pivot(index='key1', columns='key2', values='values')
#> ValueError: 인덱스 중복.

df.pivot(index='key1', columns=['key2', 'key3'], values='values')

key2   a1        a2
key3   b1   b2   b1   b2
key1
KO    1.0  2.0  3.0  NaN
US    5.0  4.0  NaN  6.0

In [21]:
df.pivot(index='key1', columns=['key3', 'key4'], values='values')

key3   b1   b2   b1   b2   b1   b2
key4   c1   c2   c3   c1   c2   c3
key1
KO    1.0  2.0  3.0  NaN  NaN  NaN
US    NaN  NaN  NaN  4.0  5.0  6.0

In [22]:
df.pivot(index=['key1', 'key2'], columns='key3', values='values')

key3        b1   b2
key1 key2
KO   a1    1.0  2.0
     a2    3.0  NaN
US   a1    5.0  4.0
     a2    NaN  6.0

In [5]:
df = pd.DataFrame(data={'gender': ['Male', 'Female'] * 3,
                        'time': ['Lunch'] * 3 + ['Dinner'] * 3,
                        'day': ['Fri', 'Sat', 'Sun'] * 2,
                        'bill': [10, 20, 30, 40, 50, 60],
                        'tip': [1, 2, 3, 4, 5, 6]})
df

   gender    time  day  bill  tip
0    Male   Lunch  Fri    10    1
1  Female   Lunch  Sat    20    2
2    Male   Lunch  Sun    30    3
3  Female  Dinner  Fri    40    4
4    Male  Dinner  Sat    50    5
5  Female  Dinner  Sun    60    6

pivot() 파라미터:
* index: 원본 데이터 프레임을 pivoting할 때 row(인덱스)로 사용할 컬럼(들) 이름.
* columns: 원본 데이터 프레임을 pivoting할 때 column으로 사용할 컬럼(들) 이름.
* values: 원본 데이터 프레임을 pivoting할 때, 각 셀에 지정된 값으로 사용할 컬럼(들) 이름.

In [7]:
# df.pivot(index='gender', columns='time', values='bill')
#> Error 발생: pivot을 한 테이블의 셀의 개수가 values의 개수보다 작아서 에러 발생.

In [8]:
df.pivot(index='gender', columns='day', values='bill')

day     Fri  Sat  Sun
gender
Female   40   20   60
Male     10   50   30

In [11]:
df.pivot(index='time', columns='day', values='bill')

day     Fri  Sat  Sun
time
Dinner   40   50   60
Lunch    10   20   30

In [12]:
df.pivot(index=['gender', 'time'], columns='day', values='bill')

day             Fri   Sat   Sun
gender time
Female Dinner  40.0   NaN  60.0
       Lunch    NaN  20.0   NaN
Male   Dinner   NaN  50.0   NaN
       Lunch   10.0   NaN  30.0

In [14]:
df.pivot(index='gender', columns=['day', 'time'], values='bill')

day      Fri   Sat   Sun    Fri    Sat    Sun
time   Lunch Lunch Lunch Dinner Dinner Dinner
gender
Female   NaN  20.0   NaN   40.0    NaN   60.0
Male    10.0   NaN  30.0    NaN   50.0    NaN

In [16]:
df.pivot(index='gender', columns='day', values=['bill', 'tip'])

       bill         tip
day     Fri Sat Sun Fri Sat Sun
gender
Female   40  20  60   4   2   6
Male     10  50  30   1   5   3

In [18]:
df.pivot(index=['gender', 'time'], columns='day', values=['bill', 'tip'])

               bill              tip
day             Fri   Sat   Sun  Fri  Sat  Sun
gender time
Female Dinner  40.0   NaN  60.0  4.0  NaN  6.0
       Lunch    NaN  20.0   NaN  NaN  2.0  NaN
Male   Dinner   NaN  50.0   NaN  NaN  5.0  NaN
       Lunch   10.0   NaN  30.0  1.0  NaN  3.0

In [19]:
df = pd.DataFrame(data={'gender': ['Male', 'Female'],
                        'Lunch': [1, 3],
                        'Dinner': [2, 4]})
df

   gender  Lunch  Dinner
0    Male      1       2
1  Female      3       4

In [20]:
df.melt(id_vars='gender')
# id_vars 파라미터: melting할 때, unpivot하지 않을 변수(컬럼)들 이름.

   gender variable  value
0    Male    Lunch      1
1  Female    Lunch      3
2    Male   Dinner      2
3  Female   Dinner      4

In [21]:
df.melt(id_vars='gender', var_name='time', value_name='bill')
# var_name 파라미터: '변수(variable)' 컬럼의 이름.
# val_name 파라미터: '값(value)' 컬럼의 이름.

   gender    time  bill
0    Male   Lunch     1
1  Female   Lunch     3
2    Male  Dinner     2
3  Female  Dinner     4

In [22]:
df.melt(id_vars='gender', value_vars='Lunch')
# value_vars 파라미터: melting할 컬럼(들) 이름.
# value_vars 파라미터를 설정하지 않으면, 
# id_vars에 설정된 컬럼들을 제외한 다른 모든 컬럼들이 melting됨.

   gender variable  value
0    Male    Lunch      1
1  Female    Lunch      3

In [23]:
df.melt(id_vars='gender', value_vars=['Lunch', 'Dinner'])

   gender variable  value
0    Male    Lunch      1
1  Female    Lunch      3
2    Male   Dinner      2
3  Female   Dinner      4

pivot_table() 함수

In [26]:
import seaborn as sns

tips = sns.load_dataset('tips')

In [27]:
tips.head()

   total_bill   tip     sex smoker  day    time  size
0       16.99  1.01  Female     No  Sun  Dinner     2
1       10.34  1.66    Male     No  Sun  Dinner     3
2       21.01  3.50    Male     No  Sun  Dinner     3
3       23.68  3.31    Male     No  Sun  Dinner     2
4       24.59  3.61  Female     No  Sun  Dinner     4

In [28]:
tips.shape

(244, 7)

In [33]:
tips[tips['sex'] == 'Female']['tip'].mean()

2.833448275862069

In [36]:
tips[tips['sex'] == 'Male']['tip'].mean()

3.0896178343949052

In [40]:
pd.DataFrame(data={'tip_mean': [2.83, 3.08]}, index=['Female', 'Male'])

        tip_mean
Female      2.83
Male        3.08

In [41]:
tips.pivot_table(values='tip', index='sex')

             tip
sex
Male    3.089618
Female  2.833448

In [42]:
tips.pivot_table(values='tip', index='sex', columns='smoker', aggfunc=np.mean)
# values: pivot을 할 때 각 셀에 value로 설정할 컬럼(들).
# index: pivot을 할 때 row의 인덱스로 설정할 컬럼(들).
# columns: pivot을 할 때 column의 이름을 설정할 컬럼(들).
# aggfunc: 집계 함수(aggregating function). 기본값은 np.mean.
#   mean, max, min, median, size, count, ...
# aggfunc 파라미터에는 함수 객체, 함수 객체들의 리스트, 또는 
# 함수 이름 문자열(str), 함수 이름들의 리스트를 전달할 수 있음.

smoker       Yes        No
sex
Male    3.051167  3.113402
Female  2.931515  2.773519

In [52]:
tips.pivot_table(values='tip', index='sex', columns='smoker', aggfunc='mean')

smoker       Yes        No
sex
Male    3.051167  3.113402
Female  2.931515  2.773519

In [45]:
tips[(tips['sex'] == 'Male') & (tips['smoker'] == 'Yes')]['tip'].mean()

3.0511666666666666

In [58]:
# 성별(row) tip(value)의 최댓값(aggfunc) -> pivot_table
tips.pivot_table(values='tip', index='sex', aggfunc=np.max)  # aggfunc='max'

         tip
sex
Male    10.0
Female   6.5

In [60]:
tips[tips['sex'] == 'Male']['tip'].max()

10.0

In [62]:
# 성별(row), 시간별(column) tip(value)의 최솟값(aggfunc) -> pivot_table
pivoted = tips.pivot_table(index='sex', columns='time', values='tip', aggfunc='min')  # aggfunc=np.min
pivoted

time    Lunch  Dinner
sex
Male     1.44     1.0
Female   1.25     1.0

In [66]:
pivoted.melt(value_vars=['Lunch', 'Dinner'], ignore_index=False, 
             value_name='tip_mean')

          time  tip_mean
sex
Male     Lunch      1.44
Female   Lunch      1.25
Male    Dinner      1.00
Female  Dinner      1.00

In [69]:
# 성별(row), 흡연 여부별(row), 요일별(column) tip(value)의 평균(aggfunc)
pivoted = tips.pivot_table(values='tip', index=['sex', 'smoker'], columns='day', 
                           aggfunc=np.mean)
pivoted

day              Thur       Fri       Sat       Sun
sex    smoker
Male   Yes     3.0580  2.741250  2.879259  3.521333
       No      2.9415  2.500000  3.256563  3.115349
Female Yes     2.9900  2.682857  2.868667  3.500000
       No      2.4596  3.125000  2.724615  3.329286

In [73]:
pivoted.melt(ignore_index=False, value_name='tip_mean')

                day  tip_mean
sex    smoker
Male   Yes     Thur  3.058000
       No      Thur  2.941500
Female Yes     Thur  2.990000
       No      Thur  2.459600
Male   Yes      Fri  2.741250
       No       Fri  2.500000
Female Yes      Fri  2.682857
       No       Fri  3.125000
Male   Yes      Sat  2.879259
       No       Sat  3.256563
Female Yes      Sat  2.868667
       No       Sat  2.724615
Male   Yes      Sun  3.521333
       No       Sun  3.115349
Female Yes      Sun  3.500000
       No       Sun  3.329286

In [75]:
# 성별(row), 흡연여부별(row), 요일별(column), 시간별(column) tip(value)의 중앙값(aggfunc)
tips.pivot_table(values='tip', index=['sex', 'smoker'], columns=['day', 'time'],
                 aggfunc=np.median)

day             Thur          Fri           Sat    Sun
time           Lunch Dinner Lunch Dinner Dinner Dinner
sex    smoker
Male   Yes     2.780    NaN  1.92   3.00   3.00    3.5
       No      2.405    NaN   NaN   2.50   2.86    3.0
Female Yes     2.500    NaN  2.50   2.75   2.50    3.5
       No      2.000    3.0  3.00   3.25   2.75    3.5

In [77]:
tips[(tips['sex'] == 'Male') &
     (tips['smoker'] == 'Yes') &
     (tips['day'] == 'Thur') &
     (tips['time'] == 'Lunch')]['tip'].median()

2.7800000000000002

In [78]:
tips['sex'].value_counts()  # pd.Series

Male      157
Female     87
Name: sex, dtype: int64

In [86]:
tips.pivot_table(index='sex', values='tip', aggfunc='count')
# count: NA가 데이터들의 개수

        tip
sex
Male    157
Female   87

In [89]:
# 성별, 요일별 size의 합계
tips.pivot_table(values='size', index='sex', columns='day', aggfunc=np.sum)  # aggfunc='sum'

day     Thur  Fri  Sat  Sun
sex
Male      73   21  156  163
Female    79   19   63   53

In [91]:
# 성별(row), 시간별(column) 영수증금액(value), 팁(value)의 평균(aggfunc)
tips.pivot_table(index='sex', columns='time', values=['total_bill', 'tip'],
                 aggfunc=np.mean)

             tip           total_bill
time       Lunch    Dinner      Lunch     Dinner
sex
Male    2.882121  3.144839  18.048485  21.461452
Female  2.582857  3.002115  16.339143  19.213077

In [92]:
# 성별(row), 시간별(column) 팁(value)의 최솟값(aggfunc), 최댓값(aggfunc)
tips.pivot_table(values='tip', index='sex', columns='time',
                 aggfunc=[np.min, np.max])  # aggfunc=['min', 'max']

        amin         amax
time   Lunch Dinner Lunch Dinner
sex
Male    1.44    1.0  6.70   10.0
Female  1.25    1.0  5.17    6.5

In [93]:
# 성별(row), 시간별(column) 영수증 금액(value)의 평균(aggfunc), 팁(value)의 최솟값, 최댓값(aggfunc)
tips.pivot_table(values=['total_bill', 'tip'],
                 index='sex',
                 columns='time',
                 aggfunc={'total_bill': np.mean,
                          'tip': [np.min, np.max]})

         tip                     total_bill
        amax         amin              mean
time   Lunch Dinner Lunch Dinner      Lunch     Dinner
sex
Male    6.70   10.0  1.44    1.0  18.048485  21.461452
Female  5.17    6.5  1.25    1.0  16.339143  19.213077

In [97]:
pivoted = tips.pivot_table(values = 'tip', index = ['sex','smoker'], columns = ['day','time'])
pivoted

day                Thur          Fri              Sat       Sun
time              Lunch Dinner Lunch Dinner    Dinner    Dinner
sex    smoker
Male   Yes     3.058000    NaN  1.90  3.246  2.879259  3.521333
       No      2.941500    NaN   NaN  2.500  3.256563  3.115349
Female Yes     2.990000    NaN  2.66  2.700  2.868667  3.500000
       No      2.437083    3.0  3.00  3.250  2.724615  3.329286

In [103]:
pivoted = tips.pivot_table(values = 'tip', index = ['sex','smoker', 'time'], columns = 'day')
pivoted

day                       Thur    Fri       Sat       Sun
sex    smoker time
Male   Yes    Lunch   3.058000  1.900       NaN       NaN
              Dinner       NaN  3.246  2.879259  3.521333
       No     Lunch   2.941500    NaN       NaN       NaN
              Dinner       NaN  2.500  3.256563  3.115349
Female Yes    Lunch   2.990000  2.660       NaN       NaN
              Dinner       NaN  2.700  2.868667  3.500000
       No     Lunch   2.437083  3.000       NaN       NaN
              Dinner  3.000000  3.250  2.724615  3.329286